# M2 Curated Brewfile
# Essential packages for Mac development environment

# Core taps
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"

# ==============================================================================
# DEVELOPMENT TOOLS
# ==============================================================================

# Essential CLI tools
brew "git"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "ripgrep"
brew "neovim"
brew "zlib"
brew "curl"
brew "wget"

# Programming Languages
brew "node"
brew "python@3.11"

# Container & DevOps
brew "docker"
brew "docker-compose"

# ==============================================================================
# FONTS
# ==============================================================================

# Programming Fonts
cask "font-jetbrains-mono"
cask "font-source-code-pro"

# ==============================================================================
# APPLICATIONS
# ==============================================================================

# Browser & Development
cask "google-chrome"
cask "kitty"

# Media Tools
cask "vlc"
cask "obs"
cask "multiviewer"

# Productivity
cask "obsidian"

# Utilities
cask "android-file-transfer"
cask "istat-menus"

# Communication
cask "microsoft-teams"
cask "discord"

# ==============================================================================
# VSCODE EXTENSIONS
# ==============================================================================

# Theme & Icons
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"

# Essential Extensions
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.vscode-docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "ms-python.python"

# SQL Server Tools
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-database-projects-vscode"