# M2 Comprehensive Brewfile
# Complete package management for Mac development environment

# Core taps
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"

# ==============================================================================
# DEVELOPMENT TOOLS
# ==============================================================================

# Essential CLI tools
brew "git"
brew "zsh-autosuggestions"
brew "ripgrep"
brew "neovim"
brew "zlib"

# Azure & Cloud
brew "azure-cli"

# Programming & Development
brew "node"
brew "python@3.11"
brew "maven"
brew "gradle"
brew "docker"
brew "docker-compose"
brew "kubectl"

# Version Management
brew "nvm"
brew "pyenv"
brew "rbenv"

# Build Tools
brew "cmake"
brew "make"
brew "gcc"

# Database Tools
brew "postgresql"
brew "redis"
brew "sqlite"

# Utilities
brew "curl"
brew "wget"
brew "jq"
brew "tree"
brew "htop"
brew "btop"
brew "exercism"
brew "lf"
brew "neofetch"

# Code Quality
brew "prettier"
brew "eslint"
brew "shellcheck"

# ==============================================================================
# FONTS
# ==============================================================================

# Programming Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
cask "font-cascadia-code"
cask "font-hack"

# System & Design Fonts
cask "font-inter"
cask "font-roboto"
cask "font-open-sans"

# ==============================================================================
# DEVELOPMENT APPLICATIONS
# ==============================================================================

# Code Editors & IDEs
cask "arc"
cask "brave-browser"
cask "google-chrome"
cask "azure-data-studio"
cask "kitty"

# Development Tools
cask "docker"
cask "postman"
cask "sourcetree"
cask "github-desktop"

# Design & Prototyping
cask "figma"
cask "sketch"

# Database Management
cask "sequel-pro"
cask "tableplus"

# ==============================================================================
# MEDIA & CREATIVE TOOLS
# ==============================================================================

# Video & Audio
cask "vlc"
cask "iina"
cask "handbrake"
cask "audacity"

# Image Editing
cask "gimp"
cask "imageoptim"
cask "keka"

# Screen Recording
cask "obs"
cask "loom"
cask "multiviewer"

# ==============================================================================
# PRODUCTIVITY APPLICATIONS
# ==============================================================================

# Note Taking & Documentation
cask "notion"
cask "obsidian"
cask "typora"

# Task Management
cask "todoist"
cask "things"

# Window Management
cask "rectangle"
cask "magnet"

# File Management
cask "the-unarchiver"
cask "appcleaner"
cask "android-file-transfer"

# System Monitoring
cask "istat-menus"
cask "activity-monitor"
cask "coconutbattery"

# Virtualization
cask "parallels"
cask "vmware-fusion"

# ==============================================================================
# SYSTEM UTILITIES
# ==============================================================================

# Terminal Enhancement
cask "iterm2"
brew "oh-my-zsh"
brew "tmux"
brew "fzf"

# Security
cask "1password"
cask "malwarebytes"

# Backup & Sync
cask "dropbox"
cask "google-drive"
cask "backblaze"

# Network Tools
brew "nmap"
brew "wireshark"
cask "wireshark"

# ==============================================================================
# COMMUNICATION TOOLS
# ==============================================================================

# Team Communication
cask "slack"
cask "discord"
cask "microsoft-teams"
cask "zoom"

# Email & Calendar
cask "mail"
cask "fantastical"

# Remote Access
cask "anydesk"
cask "teamviewer"

# ==============================================================================
# JUPYTER & DATA SCIENCE
# ==============================================================================

brew "jupyterlab"
brew "numpy"
brew "pandas"
brew "matplotlib"

# ==============================================================================
# VSCODE EXTENSIONS
# ==============================================================================

# Theme & Icons
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"

# Database Extensions
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "qwtel.sqlite-viewer"

# Python Development
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "kevinrose.vsc-python-indent"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "njpwerner.autodocstring"

# Containers & Cloud
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"

# .NET Development
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"

# SQL Server Tools
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"

# Jupyter Support
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"

# Additional Development Extensions
vscode "esbenp.prettier-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "ms-vscode.vscode-typescript-next"
vscode "formulahendry.auto-rename-tag"
vscode "christian-kohler.path-intellisense"